{"url":"https://www.fool.com/earnings/call-transcripts/2021/05/04/agree-realty-corp-adc-q1-2021-earnings-call-transc/","headline":"Agree Realty Corp (ADC) Q1 2021 Earnings Call Transcript | The Motley Fool","event_time":"2021-05-04T09:00:00-04:00","company_name":"Agree Realty Corp ","company_ticker":"ADC","fiscal_quarter":"Q1 2021","daily_volatility":0.011233295907294029,"closing_price_day_before":["2021-05-03",64.3251],"closing_price_day_of":["2021-05-04",64.316],"closing_price_day_after":["2021-05-05",63.1563],"text_blocks":[{"section":"Prepared Remarks","speaker":"Operator","text":"\nGood morning, and welcome to the Agree Realty First Quarter 2021 Conference Call. [Operator Instructions] Please note, this event is being recorded. I would now like to turn the conference over to Simon Leopold, Chief Financial Officer. Please go ahead, Simon."},{"section":"Prepared Remarks","speaker":"Simon J. Leopold -- Executive Vice President, Chief Financial Officer & Secretary","text":"\nGood morning, everyone, and thank you for joining us for Agree Realty's First Quarter 2021 Earnings Call. Before we begin, I'd like to thank Joey and the Board for the opportunity to join ADC and the outstanding team that they have assembled. I'm very excited to build upon the long track record of success here at Agree. I look forward to contributing to the company's next phase of growth while maximizing value for all stakeholders. Before turning the call over to Joey to discuss our results for the quarter, let me first run through the cautionary language. Please note that during this call we will make certain statements that may be considered forward-looking under federal securities law. Our actual results may differ significantly from the matters discussed in any forward-looking statements for a number of reasons, including uncertainty related to the scope, severity and duration of the COVID-19 pandemic, the actions taken to contain the pandemic or mitigate its impact and the direct and indirect economic effects of the pandemic and containment measures on us and on our tenants. Please see yesterday's earnings release and our SEC filings, including our latest annual report on Form 10-K and subsequent reports for a discussion of various risks and uncertainties underlying our forward-looking statements. In addition, we discuss non-GAAP financial measures, including core funds from operations or core FFO, adjusted funds from operations or AFFO, and net debt to recurring EBITDA. Reconciliations of these non-GAAP financial measures to the most directly comparable GAAP measures can be found in our earnings release, website and SEC filings. I'll now turn the call over to Joey."},{"section":"Prepared Remarks","speaker":"Joel N. Agree -- President, Chief Executive Officer & Director","text":"\nThank you, Simon, and welcome aboard. Good morning, everybody. I'm pleased to report that ADC 3.0 is officially under way. Our focus on people, processes and systems, combined with the unique and unprecedented opportunity in the marketplace has accelerated trajectory of our company in every respect. Our increase in guidance reflects the success we are seeing on the acquisition front. While externally these results speak to our present and future capabilities, what is less visible is the platform infrastructure that we have constructed that powers the ADC engine. The launch of ARC, our proprietary technology platform, is the culmination of a multiyear effort. We started as an idea, and a static spreadsheet has now materialized into a powerful and dynamic tool for our growing company. At the core of our decision-making is real-time data. ARC enables and informs everything from relationship management through its CRM tool, our asset level underwriting, portfolio construction via vast modeling and planning capabilities, as well as its asset management through its work order management system. These tools have enabled our team to execute quickly and decisively in opportunities, aggregate and access data, establish key performance indicators, measure our performance, streamline and provide clarity to team members and proactively manage our growing team. We are very excited to demonstrate ARC's capability in the very near future. In addition to the technology that we have deployed, the leadership and Board additions match the opportunity we see in front of us. This is not a company that sits still, but we intend to continue to rise to the occasion and take advantage of our distinctive market positioning. Moving now to our results.\nDuring the first quarter, we invested approximately $391 million in 90 high-quality retail net lease properties across our three external growth platforms. 86 of these properties were originated through our acquisition platform, representing acquisition volume of almost $387 million, while achieving another very strong quarter of acquisition volume during these uncertain times we maintained our disciplined focus on best-in-class opportunities with leading retail partners. This was clearly demonstrated by a record 32% of first quarter acquisition volume being comprised of ground leases, and more than 72% of first quarter volume being derived from investment-grade retailers. The 86 properties acquired during the first quarter leased to 46 tenants operating in 20 distinct sectors, including best-in-class operators in the off price, consumer electronics, auto parts, general merchandise, convenience store, grocery, and tire and auto service sectors. The acquired properties had a weighted average cap rate of 6.3% and had a weighted average lease term of 12.9 years. We executed on several notable transactions during the quarter, including our first two Amazon Fresh grocery stores located in Westmont in Bloomingdale, Illinois. We're very pleased about the opportunity to add Amazon as a top 50 tenant within out portfolio and look forward to additional opportunities to grow our relationship with them. Additionally, we acquired a unique portfolio of 10 CVS stores, all of which recently signed brand new 20-year net leases at below-market rents of just over $14 per square foot on a weighted average basis. Even with this portfolio acquisition, our pharmacy exposure is still down nearly 110 basis points year-over-year, driven by portfolio growth and the opportunistic disposition of Walgreens' assets.\nWith this transaction, CBS has surpassed Walgreens as our largest pharmacy tenant, quite an accomplishment for a former Walgreen developer that at one time had nearly 40% exposure to Walgreens. By year-end, I anticipate our exposure to Walgreens to drop to at or below 1.5% of our total portfolio. The pharmacies that we've added in recent years, including this portfolio and the long-term CVS in downtown Greenwich, Connecticut reflect unique opportunities to acquire high-performing CVS stores with duration and residual values that are difficult to find in the pharmacy space. As I've discussed in recent calls, we continue to favor CVS as the sector leader, given their innovation and adaptation to consumer preferences and overall market dynamics in the pharmacy space. The acquisition of Aetna in 2018, the rollout of the MinuteClinics and now their HealthHUB concepts continue to demonstrate thoughtful leadership. During the quarter we also added our first REI store located on a major retail thoroughfair at East Hanover, New Jersey, with median household incomes of $150,000 and a daytime population of 165,000 within a 5-mile radius. This store is positioned for long-term success. Our focus on building the highest quality retail portfolio was further evidenced by the record number of ground leases that we acquired during this past quarter.\nWe added 31 ground leases to our portfolio for an aggregate purchase price of $127 million, again representing almost 32% of annualized base rents acquired during the quarter. Our overall ground lease exposure now stands at a company record of 11.4% of our total annualized base rents. Notable ground lease acquisitions during the quarter include a CarMax in Pleasant Hill, California; six Wawa convenience stores, our First Discount Tire and the previously announced portfolio acquisition of 15 ground lease assets from Kite Realty Group. Inclusive of our first quarter acquisition activity, our ground lease portfolio now derives 89% of rents from investment-grade tenants and is comprised of the company's premier retailers. Our deep relationships across the industry as well as our team's strong track record of execution continues to deliver additional opportunities to add such properties to this expanding sub portfolio. Given our robust acquisition activity in the first quarter and enhanced visibility into our pipeline, we are increasing our full year 2021 acquisition guidance to a range of $1.1 billion to $1.3 billion, representing a 33% increase at the midpoint as compared to our previous annual guidance. This increase reflects the fact that we're seeing very strong opportunities to grow our portfolio while remaining disciplined and committed to our stringent investment criteria. We continue to view retail real estate as dynamic and bifurcated into long-term winners and losers, and we fully intend to stay on the winning side. At quarter end, our portfolio's investment-grade exposure stood at more than 67%, representing a significant year-over-year increase of more than 750 basis points. On a 2-year stacked basis, our investment-grade exposure has improved by almost 1,500 basis points.\nMoving on to our development in Partner Capital Solutions platforms, we continue to see compelling opportunities. We had four development in PCS projects either completed or under construction during the first quarter that represent total capital committed of more than $14 million. One of these projects was completed during the quarter, our second development with Burlington in Texarkana, Texas. I'm pleased to announce we also commenced our first development with 7-Eleven during the quarter located in Saginaw, Michigan. 7-Eleven will be subject to a new 15-year lease upon completion, and we anticipate delivery will take place in the first quarter of 2022. Construction continued during the first quarter on two development and PCS projects with anticipated total costs of more than $8 million. The projects consist of a grocery outlet in Port Angeles, Washington and a Gerber Collision in Buford, Georgia. Subsequent to quarter end, we commenced our first development with Floor and Decor in Naples, Florida, where they will be subject to a new 15-year lease. We anticipate total cost for this project to be approximately $20 million, with rent commencing by January of 2022. We remain focused on leveraging our 3-prong external growth platform to expand our relationships with best-in-class retailers, and we look forward to updating you on progress in the quarters ahead. Moving on to dispositions.\nWe sold three properties for total gross proceeds of nearly $9 million during the first quarter. These dispositions were completed at a weighted average cap rate of 6.8% and included a short-term Walgreens in Big Rapids, Michigan, as well as another franchise restaurant. Subsequent to quarter end, we sold our Dave & Busters in Austin, Texas for approximately $10.5 million, representing a cap rate of 7.4%. Notably, Dave & Busters had less than four years remaining on the base term of their lease at the time of sale. This disposition is reflective of our real estate underwriting and the ability to sell this asset at an IRR of more than 8% is a testament to the quality of real estate in our portfolio. This sale reduced our Dave & Buster's exposure to just two remaining locations. During the quarter, we executed new leases, extensions or options on approximately 66,000 square feet of gross leasable area. As a result of our asset management team's efforts, at quarter end our lease maturities for 2021 stood at just 0.4% of annualized base rents, representing a quarter-over-quarter decrease of approximately 50 basis points and a year-over-year decrease of approximately 170 basis points. Our 2022 lease maturities are in a very positive position as well, with only 21 leases or 1.2% of ABR expiring during the course of the year. No single lease maturity exceeds $600,000 annualized base rents and represents only 0.2% of ABR. As of March 31, our rapidly growing retail portfolio consisted of 1,213 properties across 46 states, including 120 ground leases. The thoughtful and disciplined construction of our leading retail portfolio continues to be reflected in our rent collections data.\nIncluding April, we've now collected at least 99% of rent payments for eight consecutive months. During the quarter, we collected more than 99% of rent payments from our portfolio while entering into deferral agreements, representing less than 1% of first quarter rents. As a reminder, our collections data includes both base rent and recurring operating cost reimbursements. In addition, we include base rents and operating cost reimbursements charged to tenants in bankruptcy and have not made any COVID-related adjustments to the denominator when making these calculations. We remain committed to providing complete and transparent data to our investors on our collections. I'm also pleased to report that our inaugural ESG report was published in the first quarter and can be found in the Investors section of our website. I look forward to continue to engage with our stakeholders on the ESG front and excited about our future successes here. Lastly, I'd like to take a moment to welcome Ambassador John Rakolta Jr. back to our Board of Directors. John previously served on our Board from 2011 until his confirmation as United States Ambassador to United Arab Emirates in September of 2019. His leadership helped shape our company, and his contributions will be invaluable as we enter the next phase of our growth. With that, I'll hand the call over to Simon, then we can open it up for any questions."},{"section":"Prepared Remarks","speaker":"Simon J. Leopold -- Executive Vice President, Chief Financial Officer & Secretary","text":"\nThanks, Joey. Starting with earnings. Core funds from operations for the first quarter was $0.84 a share, a 3% year-over-year increase. Adjusted funds from operations per share for the quarter was $0.83, an increase of 2.3% year-over-year. During the past four quarters, we have elected to treat COVID-19 rent deferrals as delinquent receivables, and our FFO measures include this revenue. As a reminder, treasury stock is included within our diluted share count prior settlement if and when ADCs stock trades above the deal price of our outstanding forward equity offerings. The aggregate dilutive impact related to these offerings was negligible in the first quarter. Per FactSet, current analyst estimates for full year AFFO per share range from $3.39 to $3.53 per share, implying year-over-year growth of 6% to 10%. Given current visibility into our investment pipeline and the broader operating environment, we view this level of growth as achievable and expect to end the year toward the higher end of this range. General and administrative expenses totaled $6.9 million in the first quarter. G&A expense was 8.8% of total revenue or 8.3%, excluding the noncash amortization of above and below market lease intangibles.\nWhile we continue to invest in people and systems, our anticipation is that G&A as a percentage of total revenue will decrease approximately 100 basis points from 2020 to roughly 7% for 2021, excluding the impact of lease intangible amortization on total revenues. As a reminder, G&A expense for our acquisitions team fluctuates based on acquisition volumes for the year. And our current anticipation for G&A expense reflects acquisition volume within our new increased annual guidance range of $1.1 billion to $1.3 billion, due in part to a one-time true-up of almost $500,000 related to 2020 income taxes. Total income tax expense for the first quarter was approximately $1 million. For 2021, we now anticipate total income tax expense to be approximately $2.5 million. Moving on to our capital markets activities for the quarter. As mentioned on last quarter's call, in January, we completed a follow-on public offering of approximately 3.5 million shares of common stock, including the underwriter's option to purchase additional shares, which generated net proceeds of almost $222 million. We were also active on the ATM during the first quarter, entering into forward sale agreements to sell more than 372,000 shares of common stock at an average gross price of $68.93 for anticipated net proceeds of more than $25 million. On March 31, we settled 578,000 shares of our -- under our extending ATM forward offerings for net proceeds of approximately $37 million. At quarter end, we had approximately 2.9 million shares outstanding under our ATM forward offerings, which in total are anticipated to raise net proceeds of approximately $190 million upon settlement. Inclusive of the anticipated net proceeds from our outstanding forward offerings and availability under our credit facility, we have more than $450 million in available liquidity.\nAs of March 31, our pro forma net debt to recurring EBITDA was approximately 4.2 times as our outstanding forward equity offerings continue to meaningfully reduce pro forma leverage. Excluding the impact of unsettled forward equity offerings, our net debt to recurring EBITDA was approximately 4.9 times. Total debt to enterprise value at quarter end was approximately 24%, while fixed charge coverage, which includes principal amortization, increased to a company record 5 times. During the first quarter, we announced the transition to a monthly dividend and declared monthly cash dividends of $0.207 per share for January, February and March. The monthly dividend reflected an annualized dividend amount of $2.484 per share, representing a 6.2% increase over the annualized dividend amount of $2.34 per share from the first quarter of last year. Our payout ratios for the first quarter were a conservative 74% of core FFO per share and 75% of AFFO per share respectively. Subsequent to quarter end, we declared an increased monthly cash dividend of $0.217 per share. The monthly dividend reflects an annualized dividend amount of $2.604 per share or an 8.5% increase over the annualized dividend amount of $2.40 per share from the second quarter of last year. With that, I'd like to turn the call back over to Joey."},{"section":"Prepared Remarks","speaker":"Joel N. Agree -- President, Chief Executive Officer & Director","text":"\nThank you, Simon. Operator, at this time, we'll open it up for questions."},{"section":"Questions and Answers","speaker":"Operator","text":"\n[Operator Instructions] Our first question comes from Ki Bin Kim with Truist. Please go ahead."},{"section":"Questions and Answers","speaker":"Ki Bin Kim -- Truist Securities, Inc. -- Analyst","text":"\nHi, Good morning. Joey, can you talk about your leverage philosophy? I believe your last quoted target range was about four to 5 times [Indecipherable] to EBITDA. Why is that the right range for you guys? Why not a little bit higher? It will be great to see that total AFFO growth translate to more AFFO per share growth. And when you take into account the high quality nature of your EBITDA, 70% investment-grade and all that, I would think it could support a higher leverage range relatively speaking."},{"section":"Questions and Answers","speaker":"Joel N. Agree -- President, Chief Executive Officer & Director","text":"\nYes. Good morning Ki Bin. I think -- well, I think if you look at net lease generally in our portfolio, specifically in a private context, I think net lease, of course, you're right, it does, in a private context support significantly more leverage. What we found is running a conservative balance sheet with the liquidity and strictly the balance sheet capacity to continue to expand our business, which is growing at a clip of, call it, 33% per annum here is prudent. So during the pandemic, we brought our stated leverage target down from four -- from five to 6 times to four to 5 times. We've historically been operating in that range and really anyway inclusive of the forward equity offering. So today sitting at pro forma 4.2 times, we think we're in a fantastic position to continue to execute on our pipeline near-term and long term. But at the same time, these aren't hard-and-fast rules. Tools like the forward equity offering give us the ability, right, to move leverage between that four and five and even potentially to north of the 5 times. But I think as Simon mentioned in the prepared comments, we think we can achieve upper single-digit AFFO growth here even with a strong balance sheet that's running between four and 5 times. So while the portfolio certainly could support higher leverage, we think it's prudent to maintain the dry powder to continue to execute on the business. Simon, you want to add anything?"},{"section":"Questions and Answers","speaker":"Simon J. Leopold -- Executive Vice President, Chief Financial Officer & Secretary","text":"\nYes. The only thing I'd add, Ki Bin, is that we -- it's really important that we continue to be able to raise capital in an efficient, cost-effective way. And with the leverage where it is right now, we think we're clearly going to be very appealing to investors in the bond market, and that's a really important part of our overall capital strategy. And we're able to achieve the kind of AFFO growth that Joey talked about, that I talked about on the call at these leverage points. So it seems like the right place to us. It's a comfortable balance between sort of all the stakeholders' interest in the company."},{"section":"Questions and Answers","speaker":"Operator","text":"\nOur next question comes from Katy McConnell with Citi. Please go ahead."},{"section":"Questions and Answers","speaker":"Mary Kathleen McConnell -- Citigroup Inc. -- Analyst","text":"\nThanks. Good morning everyone. Can you provide some insight into the volume of deals sourced versus closed during the quarter? And are you making any changes in your underwriting criteria or assets that you're targeting based on the new technology you are using with the ARC platform?"},{"section":"Questions and Answers","speaker":"Joel N. Agree -- President, Chief Executive Officer & Director","text":"\nNo. Good morning Kate, The first part of your question broke up. Was that the specifics about what we acquired during the quarter?"},{"section":"Questions and Answers","speaker":"Mary Kathleen McConnell -- Citigroup Inc. -- Analyst","text":"\nYes, just the volume that you sourced as opposed to closed?"},{"section":"Questions and Answers","speaker":"Joel N. Agree -- President, Chief Executive Officer & Director","text":"\nSo I'd tell you, we close the vast majority of assets that we source as long as obviously we clear diligence and receive estoppels and the like. And so in terms of sourcing, we will continue to bat to upper single digits. That's our business here. We've had 6%, 7%, 8% of what we actually close on in terms of what comes into investment committee. And so the team is doing a tremendous job on covering opportunities. And so it's fair to say we look at billions of dollars in any given quarter if we're acquiring close to $400 million. The second, to your second part of your question, what ARC enables is really real-time access to data and the transactional capabilities to match. And then the dashboarding capabilities, as I mentioned in the prepared remarks. So it's a fantastic tool for our team, both on the origination side as well as throughout the entire real estate life cycle of an asset. But I would anticipate our acquisition activity in coming quarters to be similar in terms of composition. We'll continue to focus on industry-leading retailers in our \"sandbox\". We'll continue to source opportunistically high-quality ground lease assets, and our focus will remain in best-in-class omnichannel operators."},{"section":"Questions and Answers","speaker":"Mary Kathleen McConnell -- Citigroup Inc. -- Analyst","text":"\nOkay. Thanks. And then now that you've sold the Dave & Buster's asset, what are your plans to further sell down entertainment exposure? And what does demand look like for this category of tenants today?"},{"section":"Questions and Answers","speaker":"Joel N. Agree -- President, Chief Executive Officer & Director","text":"\nSo the totality of our entertainment exposure is the two remaining Dave & Buster's assets. And the ones in Downtown New Orleans in a mixed-use complex, which is a very unique -- very unique property for us. And adjacent to the smoothie center and the Mercedes-Benz done, the former dome there in New Orleans, and so the superdome. So those are the totality, that's the totality of our exposure there. And so we were never overly inquisitive in the experiential/entertainment sector to begin with. And so, those are the two assets. We're very comfortable with them. Obviously, if we get the right bid for them, we look at the opportunities to dispose of them. I think that Dave & Buster's in Austin is representative of the high-quality nature of our real estate. That asset had 3.7 years of remaining term on it, and we were able to achieve mid-7 cap rate. So I think that was an optimal outcome for us there. And that was an inbound, which we've been talking about for a couple of quarters now. It wasn't even openly marketed."},{"section":"Questions and Answers","speaker":"Mary Kathleen McConnell -- Citigroup Inc. -- Analyst","text":"\nThats great. Thank you."},{"section":"Questions and Answers","speaker":"Joel N. Agree -- President, Chief Executive Officer & Director","text":"\nThanks Kathy."},{"section":"Questions and Answers","speaker":"Operator","text":"\nOur next question comes from Nate Crossett with Berenberg. Please go ahead."},{"section":"Questions and Answers","speaker":"Nathan Daniel Crossett -- Joh. Berenberg, Gossler & Co. KG -- Analyst","text":"\nGood morning guys. Just curious to get your comments on what the outlook for pricing looks like as far out as you can see, I guess. Is there any pressure there? Have you seen any change with kind of rates backing up? Or what should we kind of be expecting?"},{"section":"Questions and Answers","speaker":"Joel N. Agree -- President, Chief Executive Officer & Director","text":"\nWell, I think pricing in the high quality net lease space and from comments from some of our peers and just general market data, we see it in the lower tier in terms of quality in the net lease space continues to be attractive. And we continue to see aggressive cap rates marginally compressing. We continue here, specifically to source value, given our relationships, our technology now and just the depth and breadth of our team. But in terms of cap rates on a go-forward basis, if the tenure stays in this range bound here, in the [16] range, let's call it, plus or minus 20 basis points. I don't -- I truly don't see any material movement in cap rates or any upward pressure in terms of cap rates."},{"section":"Questions and Answers","speaker":"Nathan Daniel Crossett -- Joh. Berenberg, Gossler & Co. KG -- Analyst","text":"\nOkay. That's helpful. And then, a record quarter for ground leases for you guys. Is there anything to call out there that's driving increased volume there? Was it -- or is it just a function of the Kite Realty portfolio? And are there other portfolios like that, that are out there that you can get?"},{"section":"Questions and Answers","speaker":"Joel N. Agree -- President, Chief Executive Officer & Director","text":"\nWell, Kite was certainly a component there. But as we talked about in the prepared remarks, we acquired a number of Wawa was. We acquired a CarMax in California, long-term ground lease in Pleasanton, California to CarMax, who we continue to view really in a superior position in the used car space given the nature and breadth and depth of their different lines of businesses. And we continue to source unique opportunities like the Discount Tire on a one-off basis. So the Kite portfolio certainly was a piece of it. We'll continue to look at such portfolios as they arise. But the vast majority of opportunities were truly on a one-off basis there."},{"section":"Questions and Answers","speaker":"Nathan Daniel Crossett -- Joh. Berenberg, Gossler & Co. KG -- Analyst","text":"\nOkay. Thanks guys."},{"section":"Questions and Answers","speaker":"Joel N. Agree -- President, Chief Executive Officer & Director","text":"\nThanks Nate."},{"section":"Questions and Answers","speaker":"Operator","text":"\nOur next question comes from Haendel St. Juste from Mizuho. Please go ahead."},{"section":"Questions and Answers","speaker":"Haendel Emmanuel St. Juste -- Mizuho Securities USA LLC -- Analyst","text":"\nHi, good morning."},{"section":"Questions and Answers","speaker":"Joel N. Agree -- President, Chief Executive Officer & Director","text":"\nGood morning."},{"section":"Questions and Answers","speaker":"Haendel Emmanuel St. Juste -- Mizuho Securities USA LLC -- Analyst","text":"\nJoey, I guess we've seen a pick up here in M&A, Kimco, Weingarten and Realty Income and VEREIT the latest. I guess I'm curious on what your view on the backdrop for M&A today is here in the space and if there's any scenarios we could see ABC participating. And then also more broadly, curious what your thoughts on the pricing from the Realty Income and VEREIT merger. Thanks."},{"section":"Questions and Answers","speaker":"Joel N. Agree -- President, Chief Executive Officer & Director","text":"\nWell, it's certainly interesting to see public-to-public M&A in the overall retail space. I think the shopping center space potentially was a long time coming, and I'm not sure if we've seen the remainder -- all of it in totality, given just the number of operators in the space and the different pressures on the space. I think, look, M&A is, obviously it is unique. It is transaction-specific. We'll continue to look at any and all opportunities. And most importantly, I think the M&A we've seen in our space and as well as adjacencies provides us a continued opportunity to execute on what we do. We are not a portfolio purchaser, generally speaking; we're not a sale-leaseback purchaser, generally speaking. We're focused on a very tight sandbox here of the best retailers in the country. And we have 80 -- 80-plus or minus transactions going through our pipeline at any given time at a very granular nature average price point of $4 million to $5 million. And so our competitive set continues to be private purchasers, 1031 purchasers, levered purchasers on the asset leverage on the asset level. And so it's a very unique opportunity for us to continue to accelerate and expand our business with an M&A backdrop there, and we'll continue to look at opportunities. I've always said what we will never do is dilute the quality of this portfolio. We are on a march to improve what we think is already the highest quality retail portfolio in the country. And we are going to continue to drive that home. Now pandemic surge sales and the like and a lot of unique circumstances have made retailers outside of our sandbox appear more attractive in the near term. But as I stated in the prepared remarks, we really view retail as K here. There's going to be continued dynamic transformation in that -- in retail. We're focused on the up leg of that K in the winters there."},{"section":"Questions and Answers","speaker":"Haendel Emmanuel St. Juste -- Mizuho Securities USA LLC -- Analyst","text":"\nGot it. Thank you for that. Anything on the contract LOI today? And then, as part of that, I'm thinking, what your overall view on exposure for the ground lease side of your business could grow to, how you're thinking about that over time."},{"section":"Questions and Answers","speaker":"Joel N. Agree -- President, Chief Executive Officer & Director","text":"\nWell, I continue -- the team continues to surprise me about the ability to source ground lease assets. They are -- and I say consistently that we think the best risk-adjusted returns by a significant margin in retail real estate. The ground lease portfolio at 11.4% has almost doubled in size in approximately, I'd say, 24 months. I anticipate it to tick higher in Q2, just given what the extent of the pipeline that we can see currently with similar opportunities that we executed on Q1. And so, it's a unique aspect to our business. The team through their efforts surprised me about their capabilities to continue to uncover those truly on a granular basis. Where it goes from here will be a function of the team's efforts and pricing and what makes sense qualitatively within the portfolio. So I wouldn't have predicted 11.4%. I wouldn't have predicted historically it would be north of there at 6.30%, but we continue to find those opportunities."},{"section":"Questions and Answers","speaker":"Haendel Emmanuel St. Juste -- Mizuho Securities USA LLC -- Analyst","text":"\nAnd on the contract or LOI side, anything you tried on that front?"},{"section":"Questions and Answers","speaker":"Joel N. Agree -- President, Chief Executive Officer & Director","text":"\nNothing specific. Our pipeline continues to be strong for Q2. Hence, the raise of the guidance we're beginning to source for Q3 opportunities today. There are some unique transactions and they're similar to Q1, obviously diverse geographically by sector and by tenant, but nothing overly notable or nothing that we're going to call out today."},{"section":"Questions and Answers","speaker":"Haendel Emmanuel St. Juste -- Mizuho Securities USA LLC -- Analyst","text":"\nThank you."},{"section":"Questions and Answers","speaker":"Joel N. Agree -- President, Chief Executive Officer & Director","text":"\nThanks Haendel."},{"section":"Questions and Answers","speaker":"Operator","text":"\nOur next question comes from Linda Tsai with Jefferies. Please go ahead."},{"section":"Questions and Answers","speaker":"Linda Tsai -- Jefferies LLC -- Analyst","text":"\nHi, good morning."},{"section":"Questions and Answers","speaker":"Simon J. Leopold -- Executive Vice President, Chief Financial Officer & Secretary","text":"\nGood morning."},{"section":"Questions and Answers","speaker":"Linda Tsai -- Jefferies LLC -- Analyst","text":"\nTo reach the high end of consensus estimates, Simon, I think you said 10% year-over-year growth. Does this assume $1.3 billion in transaction volume? And what kind of assumption does this incorporate on the equity side?"},{"section":"Questions and Answers","speaker":"Simon J. Leopold -- Executive Vice President, Chief Financial Officer & Secretary","text":"\nWell, the range was 6% to 10%. And what we said was that we expect it to be toward the higher end, not necessarily all the way to 10%. But it does incorporate the range of outcomes on acquisitions that we put out there, the $1.1 billion to $1.3 billion. And look, you never know exactly where you're going to get. This is not a precise science. We're out there buying things every day. But that's what we're trying to get to. It also does require an acceleration of the results quarter-over-quarter. So we had, call it, $0.83 of AFFO in this first quarter. In order to get to that higher end of the range, it does require an acceleration of results toward the back end, and that's really a function of our acquisition pipeline."},{"section":"Questions and Answers","speaker":"Linda Tsai -- Jefferies LLC -- Analyst","text":"\nThanks. And then, Joey, in your prepared remarks, you highlighted the CVS in Greenwich and an REI in East Hanover. Are you seeing more compelling opportunities come to market in higher income areas? Or is this part of a focus to gain higher exposure to these markets?"},{"section":"Questions and Answers","speaker":"Joel N. Agree -- President, Chief Executive Officer & Director","text":"\nJust for clarity, Linda, the CVS in Greenwich was acquired, I believe, in 2020 or late 2019. The CVS portfolio, the [ted pack] was acquired in the first quarter. We continue to be geographically very dispersed. That is from urban to rural to street retail to ground leases, really across that spectrum as long as within our sandbox. So we've seen accelerated opportunities in the Sun Belt, just given the nature of construction starts down there. We've seen accelerated opportunities in the south. But really, we're opportunistic in terms of going coast-to-coast and north to south across the country."},{"section":"Questions and Answers","speaker":"Linda Tsai -- Jefferies LLC -- Analyst","text":"\nThank you."},{"section":"Questions and Answers","speaker":"Joel N. Agree -- President, Chief Executive Officer & Director","text":"\nThanks Linda."},{"section":"Questions and Answers","speaker":"Operator","text":"\nOur next question comes from Todd Stender with Wells Fargo. Please go ahead."},{"section":"Questions and Answers","speaker":"Todd Jakobsen Stender -- Wells Fargo Securities, LLC -- Analyst","text":"\nThanks. And Joey, just to kind of hone in on the CVS transaction. How big a deal was that? What was the remaining lease term before you blended and extended? Maybe just some context there. I think you've commented on the rent being below market. Maybe I need more color, please."},{"section":"Questions and Answers","speaker":"Joel N. Agree -- President, Chief Executive Officer & Director","text":"\nSo that transaction, as I mentioned, was unique. These are CVS locations in their core markets in the Midwest. Short remaining lease terms of approximately five years on those stores, fully recast into 20-year leases, 10 stores. It was approximately, off the top of my head, about $30 million. The unique aspect of the transaction was not only that CVS -- I mentioned in the remarks, extended for a full 20 years. But also, if you look at per square foot rental rates and aggregate rental rates across the pharmacy space, they typically range from $25 to $35 per square foot. Part of my challenge with pharmacy acquisitions historically, and hence the dispositions of the Walgreens and our overall exposure reduction and overall exposure was the replacement rents on those approximate 13,000 to 14,000 square foot buildings, which typically ran from 1/3 to half. And so in context of this transaction, we have CVSs that are paying approximately just over $14 per square foot, brand-new recast, 20 year leases. CVS results by chance came out this morning, again beating the street with impressive results. And so we're a fan of what CVS is doing both transformationally within their business, but also on the real estate front.\nAnd so, as I mentioned, Walgreens really went really post the acquisition by Boots Alliance and hence then -- then the attempted acquisition of Rite Aid to increasing store count. While CVS went in a divergent health and wellness aspect. They had the PBM historically, the Aetna purchase, the Minute Clinic rollout and now the HealthHUBs, which are extremely impressive, if anyone's had the opportunity to see them, if they continue to roll out is really a vertically integrated health and wellness business. And so we are -- we like what they're doing from a corporate perspective. We're hesitant on the front end of pharmacy. We're hesitant on the residuals historically. But given the nature of the low price point, the low per square foot rental rates and the low per square foot purchase prices and the 20-year CVS leases, we thought this was an extremely attractive transaction."},{"section":"Questions and Answers","speaker":"Todd Jakobsen Stender -- Wells Fargo Securities, LLC -- Analyst","text":"\nAll right. That's helpful. Thanks joey. And then I don't know if I missed this, what are the assets that are on top of the ground leases that you acquired from Kite? Any color there?"},{"section":"Questions and Answers","speaker":"Joel N. Agree -- President, Chief Executive Officer & Director","text":"\nSo it was a mixed bag. And so everything from a Chipotle to, I believe, Bank of America, to a couple of Panera Bread locations outlot to their existing shopping centers throughout their portfolio. It was an opportunity for us -- a portfolio level opportunity to increase the ground lease exposure there. And so it was a direct transaction that we thought was beneficial obviously to both parties."},{"section":"Questions and Answers","speaker":"Todd Jakobsen Stender -- Wells Fargo Securities, LLC -- Analyst","text":"\nAnd so all single tenants stand alone, no shopping centers?"},{"section":"Questions and Answers","speaker":"Joel N. Agree -- President, Chief Executive Officer & Director","text":"\nCorrect. All single tenant stand alone outlots, which is fairly unique for us."},{"section":"Questions and Answers","speaker":"Todd Jakobsen Stender -- Wells Fargo Securities, LLC -- Analyst","text":"\nAlright. Thank you."},{"section":"Questions and Answers","speaker":"Joel N. Agree -- President, Chief Executive Officer & Director","text":"\nThank you Todd"},{"section":"Questions and Answers","speaker":"Operator","text":"\nOur next question comes from Peter Hermann with Baird. Please go ahead."},{"section":"Questions and Answers","speaker":"Peter Hermann -- Baird -- Analyst","text":"\nHi Joey, Thanks for taking the questions today. Can you talk about the ability to potentially close deals faster now with the new platform?"},{"section":"Questions and Answers","speaker":"Joel N. Agree -- President, Chief Executive Officer & Director","text":"\nYes. And just -- I appreciate the question to talk about ARC a little. I'll just take the opportunity. So, yes, what I thought a few years ago is the acceleration of the business really began to ramp. What was just being the nature of an aggregator, it was difficult to project forward critical key metrics. And so Peter Coughenour, our VP of [Indecipherable] started sketching out literally on a piece of paper an idea and a concept. That idea quickly then morphed into a static spreadsheet, which required obviously significant manual input. That static spreadsheet then became powered by an IBM TM1 database. The IBM TM1 database then got switched to a MySQL database to give us the real-time and dynamic capabilities. And from there we customized our CRM tool that we hooked in to ARC through the MYSQL database. That initial projection tool then become a dashboarding tool for us for our acquisition team, really guided in part by Greg Lehmkuhl, the CEO of Lineage, who's a fantastic director on our Board, and who is a Lean guru and whose team trained and facilitated ours just in operational and using visual key management tools. So every member of our acquisition asset management transaction team now has a dashboard that they can drill into all levels of data, cut, slice, dice it, display it visually, export it to all types of really cool things.\nIn the last few quarters we have constructed even more additional modules, really expanding it to really the entire company. And so now we have a full pipeline of database that ties into our underwriting. And so it's literally a map of the country that can be drilled into, sorted and filtered by any criteria, a work order management system that spans the property level maintenance, all the way to the full debt aggregation here, work orders by duration, type of work order, planning tools in terms of seeing the number of work orders and where they span across the country. Another transaction team module is in beta, and we'll go live very shortly here. That enables the full team to see the real-time status of all transactions in our pipeline from the first contact at the CRM level, at the customer management level to the current status of the diligence. So ARC is truly the connectivity between the team and the technology we've created to harness the opportunity in a very fragmented market. It's a key ingredient for us to continue to scale.\nWithout ARC, our people and our culture, it wouldn't be possible to execute $1.1 billion to $1.3 billion of transactions with an average purchase price of $4 million to $5 million. So again, we have 50 to 100 transactions going through the pipeline at any given time. This system, this tool, the platform really gives us real-time data on all real estate activities. It gives us the capability through its dashboarding, both team and individual, to establish KPIs to measure and manage to them. So it's a powerful tool that will continue to expedite and accelerate the business here, both at the transactional level. And obviously, that rolls up, those 300-plus or minus transactions rolls up to our results at the end of the day."},{"section":"Questions and Answers","speaker":"Peter Hermann -- Baird -- Analyst","text":"\nGot it. Appreciate the call. Thank you so much."},{"section":"Questions and Answers","speaker":"Joel N. Agree -- President, Chief Executive Officer & Director","text":"\nThanks Peter."},{"section":"Questions and Answers","speaker":"Operator","text":"\n[Operator Instructions] Our next question comes from John Massocca from Ladenburg Thalmann. Please go ahead."},{"section":"Questions and Answers","speaker":"John James Massocca -- Ladenburg Thalmann & Co. Inc. -- Analyst","text":"\nGood morning."},{"section":"Questions and Answers","speaker":"Joel N. Agree -- President, Chief Executive Officer & Director","text":"\nGood morning John."},{"section":"Questions and Answers","speaker":"John James Massocca -- Ladenburg Thalmann & Co. Inc. -- Analyst","text":"\nCould you maybe provide some color on the expected investment volume cadence this year? Just kind of if you look at the 1Q '21 acquisitions and you back those out of guidance, it essentially calls for kind of around $300 million of investments, which would be kind of a notable decline versus 1Q. I'm just trying to figure out if that's based on your visibility into 2Q or just kind of conservatism around maybe 2H."},{"section":"Questions and Answers","speaker":"Joel N. Agree -- President, Chief Executive Officer & Director","text":"\nWell, I think given just the nature of our business as a granular purchaser, it's very difficult to predict or project. I mean, we truly have 0 visibility into Q4, minimal visibility into Q3. We have very good visibility now into Q2. Again, I'd remind people, our average transaction is approximately 70 days from letter of intent execution to close. Some longer, some shorter, just about the nature of the transaction. And so it's difficult, given obviously a fluid market, a fragmented space and just the nature of our business to project forward. Now we've come out with the initial guidance of $800 million to $1 billion in the first week of January, given what we know at the time. And our promise has always been when we know what we know, we will come out and adjust any expectations and provide that transparency to investors. So I would tell you, it's a combination of the environment, it's a combination of our business, and we just can't see the future. I wish we could. ARC does not allow us to see the future, unfortunately, but that will be the next module, right, Peter?"},{"section":"Questions and Answers","speaker":"John James Massocca -- Ladenburg Thalmann & Co. Inc. -- Analyst","text":"\nAnd just -- as I think about maybe -- I know you don't give quarter-to-quarter investment volume guidance. But if you think about the investment volume, guys, if you think about the $1.1 billion to $1.3 billion, is that significantly front-end loaded based on what you see today?"},{"section":"Questions and Answers","speaker":"Joel N. Agree -- President, Chief Executive Officer & Director","text":"\nWell, I wouldn't say necessarily front-end loaded. I mean, we just printed Q1 at $300 million -- approximately $380 million acquired. And so I think we can cut that up for the remaining three quarters. I don't anticipate Q2 to be very different in terms of assets that we're acquiring. Volume may be down or at that level. So we'll see where things close. Again, we can't predict whether something is going to close on July 27, 28th or July 2. It won't close on July four because everything is closed. But our business, the last outstanding issue generally to close an asset in our business is reliant upon the tenant to provide estoppels. And so things can cross quarters.\nWe have ideas that will close this quarter and then everything can get jumbled around. ARC gives us the visibility to move things around in those corners as we have those third-party respondents, diligence, outstanding estoppels and such like that. And so that provides a level of transparency, visibility for us. But closing and the timing of transactions really isn't relying necessarily upon just our operations or execution here."},{"section":"Questions and Answers","speaker":"John James Massocca -- Ladenburg Thalmann & Co. Inc. -- Analyst","text":"\nOkay. Understood. And then how is the cap rate on ground lease assets acquired in the quarter compared to kind of nonground lease investments? And I guess if you saw ground leases as a percentage of investments maybe normalize versus historical levels, how much higher, assuming ground leases were a lower cap rate, how much higher could the overall kind of blended cap rate trend?"},{"section":"Questions and Answers","speaker":"Joel N. Agree -- President, Chief Executive Officer & Director","text":"\nSo the ground lease assets, interestingly enough, due to the duration in our relationships, the duration of their base term remaining, our relationships were buying short-term, long-term ground leases. We obviously did the Kite transaction. They, generally speaking, followed in the -- within the range of our general acquisition volume. Now long-term ground leases in California can be at the lower end of the acquisition, obviously, spectrum for us in terms of cap rates. And so -- but they generally fall within that range. I don't have a percentage for you off the top of my head. But just given the nature and the disparity between some of these assets, it generally is falling within, call it, that 5% to 7% range for us, and then we end up generally in the mid 6s. There's a second part of that question? Sorry."},{"section":"Questions and Answers","speaker":"John James Massocca -- Ladenburg Thalmann & Co. Inc. -- Analyst","text":"\nNo, I think it's kind of irrelevant because they are in the same range. So makes sense. And then one last kind of bigger picture one. There have been some rumblings about kind of increased capital competition in the net lease space from leverage nonpublic buyers, lifecos, etc. Are you seeing these competitors in the sandboxes in which you tend to play?"},{"section":"Questions and Answers","speaker":"Joel N. Agree -- President, Chief Executive Officer & Director","text":"\nNo. I think the ABS-backed buyers, the CTL-backed buyers, the heavy lever buyers are looking at larger price point transactions, some of the larger sale leasebacks where we're seeing very aggressive cap rates where we haven't participated. I think I just -- again, the $4 million to $5 million average price point doesn't play itself very well to private equity sponsors or ABS- or CTL-backed purchasers there. So our competition continues to be Jane Doe. And it's a unique competitive set. Given our balance sheet, our team, our capabilities and our technology platform and cost of capital, it's -- frankly, it's a mismatch."},{"section":"Questions and Answers","speaker":"John James Massocca -- Ladenburg Thalmann & Co. Inc. -- Analyst","text":"\nOkay. Thats it for me. Thank you very much for taking the questions."},{"section":"Questions and Answers","speaker":"Joel N. Agree -- President, Chief Executive Officer & Director","text":"\nGreat. Thank you John."},{"section":"Questions and Answers","speaker":"Operator","text":"\nThis concludes our question-and-answer session. I would like to turn the conference back over to Joel Agree for any closing remarks."},{"section":"Questions and Answers","speaker":"Joel N. Agree -- President, Chief Executive Officer & Director","text":"\nThank you, operator, and thank you, everybody, for joining us today. And we look forward to catching up with everybody in June at virtual Nareit. We'll talk to you soon. Thanks."},{"section":"Questions and Answers","speaker":"Operator","text":"\n[Operator Closing Remarks]"}]}